#1 Организация программ и методы строк
my_string = input('1. Введите текст для посчета количества символов: ')    # задаем переменную с вводом произвольного значения строки
print('Количество символов:', len(my_string))   # определяем количество символов строки (длину строки)
my_string = input('2. Введите текст для перевода символов в верхний регистр : ') # задаем значение переменной для последующего перевода символов в верхний регистр
print('Результат перевода символов в верхний регистр:', my_string.upper()) # вывод всех символов строки в верхнем регистре
my_string = input('3. Введите текст для перевода символов в нижний регистр : ') # задаем значение переменной для последующего перевода символов в нижний регистр
print('Результат перевода символов в нижний регистр:', my_string.lower()) # вывод всех символов строки в нижнем регистре
my_string = input('4. Введите текст для исключения всех пробелов из него: ')  # задаем значение переменной для последующего удаления из строки всех пробелов
print("Результат удаления пробелов с текста:", my_string.replace(' ', '')) # вывод текста без пробелов
print('5. Вывод певого символа последнего заданного значения переменной "my_string":', my_string[0]) # вывод первого символа строки
print('6. Вывод последнего символа последнего заданного значения переменной "my_string":', my_string[-1]) # вывод последнего символа строки